Revit 2024 API
UnitUtils.IsSymbol Method
 Checks whether a ForgeTypeId identifies a symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsSymbol(
	ForgeTypeId symbolTypeId
)
Visual Basic
Public Shared Function IsSymbol ( _
	symbolTypeId As ForgeTypeId _
) As Boolean
Visual C++
public:
static bool IsSymbol(
	ForgeTypeId^ symbolTypeId
)
Parameters
symbolTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 The identifier to check.
Return Value
 True if the ForgeTypeId identifies a symbol, false otherwise.
Remarks
 The SymbolTypeId class offers symbol identifiers.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace